Tekla.Structures.Drawing.View.HorizontalLabelPosition
The horizontal label position types.

Tekla.Structures.Drawing.View.HorizontalLabelPosition.CenteredByViewFrame
The label is centered by the view frame.

Tekla.Structures.Drawing.View.HorizontalLabelPosition.CenteredByViewRestrictionBox
The label is centered by the view restriction box.

Tekla.Structures.Drawing.View.HorizontalLabelPosition.LeftAlignedByViewFrame
The label is left aligned by the view frame.

Tekla.Structures.Drawing.View.HorizontalLabelPosition.RightAlignedByViewFrame
The label is right aligned by the view frame.

Tekla.Structures.Drawing.View.HorizontalLabelPosition.LeftAlignByViewRestrictionBox
The label is left aligned by the view restriction box.

Tekla.Structures.Drawing.View.HorizontalLabelPosition.RightAlignByViewRestrictionBox
The label is right aligned by the view restriction box.